# ფუნქცია (function) არის კოდის ბლოკი,
# რომელიც ასრულებს კონკრეტულ დავალებას.

# ფუნქციები გამოიყენება:
# - კოდის გასამარტივებლად
# - კოდის გამეორების თავიდან ასაცილებლად
# - პროგრამის უკეთ ორგანიზებისთვის


# როგორ შევქმნათ ფუნქცია ეტაპობრივად:

# 1) ვწერთ საკვანძო სიტყვას def
# 2) ვწერთ ფუნქციის სახელს
# 3) ფრჩხილებში ვუთითებთ პარამეტრებს (თუ გვჭირდება)
# 4) ორწერტილი :
# 5) ქვემოთ ვწერთ ფუნქციის კოდს (ინდენტაციით)


# -------------------------
# მაგალითი — მარტივი ფუნქცია

def greet():
    # ეს ფუნქცია უბრალოდ ბეჭდავს მისალმებას
    print("გამარჯობა!")

greet()   # ფუნქციის გამოძახება